src/cf/src/DataProcessors/СмокТест/СмокТест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СмокТест</name>
  <comment>Технологическая обработка подсистемы «Автотесты»: открытие всех форм конфигурации и формирование всех печатных форм. Запускается параметром /C "СмокТест;путь-к-отчёту", см. docs/TESTING.md.</comment>
</mdclass:DataProcessor>

src/cf/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/DataProcessors/СмокТест/Forms/Форма/Module.bsl
// Дымовой тест из четырёх проходов.
//
// Проход 1, «открыть все формы»: перебирает формы всех объектов метаданных и получает каждую
// через ПолучитьФорму(), выполняя тем самым ПриСозданииНаСервере. Ловит ошибки серверной части форм:
// несуществующие картинки, битые запросы динсписков, обращения к удалённым реквизитам.
// Формы объектов при этом открываются пустыми - объект новый.
//
// Проход 2, «формы объектов на образцах»: те же основные формы объекта и группы, но с параметром
// «Ключ» по образцу из базы. Ловит то, что проходом 1 не видно: ветки, работающие только с
// записанным объектом. Формы, для которых в базе нет подходящего объекта, дают ПРОПУСК.
//
// Проход 3, «сформировать все печатные формы»: по каждому объекту из
// ПечатныеФормы.ОбъектыСКомандамиПечати() берёт из базы один образец и формирует каждую его
// печатную форму. Ловит ошибки модулей менеджеров печати, которые проходом по формам не видны.
//
// Проход 4, «сформировать все отчёты»: каждый вариант каждого отчёта с основной схемой компоновки
// формируется с заполненными пустыми параметрами. Ловит ошибки схем и вариантов настроек («Поле не
// найдено»), которые проходом 1 не видны: форма отчёта открывается, падает только формирование.
//
// Запуск без интерфейса: 1cv8 ENTERPRISE /C "СмокТест;<путь-к-отчёту>" (см. scripts/smoke.sh).
// Обработка пишет отчёт из строк:
//   "СТАРТ;Форм=N"                        - клиент дошёл до прогона (признак старта для smoke.sh);
//   "ОШИБКА;<что проверялось>;<описание>" - проверка не прошла;
//   "ПУСТО;<печатная форма>"              - форма сформирована, но табличный документ пустой;
//   "ПРОПУСК;<что проверялось>;<причина>" - проверить не на чем или проверка исключена;
//   "ИТОГ;Всего=N;Ошибок=M;НаОбразцах=K;ОшибокНаОбразцах=L;ПечатныхФорм=P;ОшибокПечати=Q;
//    ВариантовОтчетов=R;ОшибокОтчетов=S"
//                                         - маркер завершения прогона,
// после чего завершает работу клиента. Проверки проходов 2 и 3 в строках отчёта помечены
// префиксами «Образец.», «Печать.» и «Отчет.». При интерактивном открытии формы результат выводится
// сообщениями. Регламент и порядок разбора ошибок - docs/TESTING.md.
//
// В этом модуле - только запуск прогона и отчёт. Состав проверяемых форм, образцы объектов и
// формирование печатных форм живут в модуле менеджера обработки: всё это серверное.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Реквизит-список создаётся программно: состав форм известен только на сервере,
	// а сам перебор идёт на клиенте - ПолучитьФорму клиентский метод.
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СписокФорм", Новый ОписаниеТипов("СписокЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СписокФормОбъектов", Новый ОписаниеТипов("СписокЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизитаРежима(), Новый ОписаниеТипов("Булево")));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	// Эта же форма служит клиентским запускателем заполнения тестовых данных: серверную
	// функцию модуля менеджера иначе не позвать, а своей формы у обработки ТестовыеДанные нет.
	// Параметры формы читаются только здесь, поэтому режим сохраняется в реквизите.
	ТолькоТестовыеДанные = Ложь;
	Если Параметры.Свойство("ТолькоТестовыеДанные") Тогда
		ТолькоТестовыеДанные = (Параметры.ТолькоТестовыеДанные = Истина);
	КонецЕсли;
	ЭтотОбъект[ИмяРеквизитаРежима()] = ТолькоТестовыеДанные;

	Если ТолькоТестовыеДанные Тогда
		// Состав форм в этом режиме не нужен: прогон не идёт, заводятся образцы объектов.
		Возврат;
	КонецЕсли;

	Список = ЭтотОбъект["СписокФорм"];
	Для Каждого ПолноеИмяФормы Из Обработки.СмокТест.ПроверяемыеФормы() Цикл
		Список.Добавить(ПолноеИмяФормы);
	КонецЦикла;

	// Второй проход: те же формы объектов, но на образцах из базы. Список готовит сервер,
	// открывает их клиент - ПолучитьФорму клиентский метод.
	СписокОбъектов = ЭтотОбъект["СписокФормОбъектов"];
	Для Каждого ЭлементСписка Из Обработки.СмокТест.ФормыОбъектовСОбразцами() Цикл
		СписокОбъектов.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Прогон запускается отложенно, чтобы форма успела открыться и клиент завершил инициализацию.
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьПрогон", 1, Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьПрогон()

	ПутьОтчета = ПутьФайлаОтчета();

	Если ЭтотОбъект[ИмяРеквизитаРежима()] Тогда
		ЗаполнитьТестовыеДанные(ПутьОтчета);
		Возврат;
	КонецЕсли;

	Ошибки = Новый Массив;
	ВсегоФорм = 0;

	// Маркер старта пишется до прогона: по нему scripts/smoke.sh отличает «клиент не поднялся»
	// от «клиент работает, прогон идёт».
	ЗаписатьМаркерСтарта(ПутьОтчета, ЭтотОбъект["СписокФорм"].Количество());

	// Не «ИмяФормы»: так называется встроенное свойство формы, оно только для чтения,
	// и одноимённая переменная в модуле формы резолвится в него.
	Для Каждого ЭлементСписка Из ЭтотОбъект["СписокФорм"] Цикл
		ПроверяемаяФорма = ЭлементСписка.Значение;
		ВсегоФорм = ВсегоФорм + 1;
		Попытка
			// Именно ПолучитьФорму: выполняет ПриСозданииНаСервере без показа окна - суть смок-теста.
			// BSLLS:GetFormMethod-off
			ПолучитьФорму(ПроверяемаяФорма);
			// BSLLS:GetFormMethod-on
		Исключение
			Информация = ИнформацияОбОшибке();
			Ошибки.Добавить("ОШИБКА;" + ПроверяемаяФорма + ";" + ОшибкаОднойСтрокой(Информация));
		КонецПопытки;
	КонецЦикла;

	ВсегоФорм = ВсегоФорм + ПроверитьФормыСПараметрами(Ошибки);

	ОшибокФорм = Ошибки.Количество();

	// Второй проход: формы объектов на образцах из базы. Открываются те же формы, но с
	// параметром «Ключ» - так проверяются ветки, работающие только с записанным объектом.
	ВсегоНаОбразцах = 0;
	ОшибокНаОбразцах = 0;
	Для Каждого ЭлементСписка Из ЭтотОбъект["СписокФормОбъектов"] Цикл
		ПроверяемаяФорма = ЭлементСписка.Представление;
		Если ЭлементСписка.Значение = Неопределено Тогда
			Ошибки.Добавить("ПРОПУСК;Образец." + ПроверяемаяФорма + ";в базе нет подходящего объекта");
			Продолжить;
		КонецЕсли;
		ВсегоНаОбразцах = ВсегоНаОбразцах + 1;
		Попытка
			// BSLLS:GetFormMethod-off
			ПолучитьФорму(ПроверяемаяФорма, Новый Структура("Ключ", ЭлементСписка.Значение));
			// BSLLS:GetFormMethod-on
		Исключение
			Информация = ИнформацияОбОшибке();
			СтрокаОтчета = "ОШИБКА;Образец." + ПроверяемаяФорма + " (" + Строка(ЭлементСписка.Значение) + ");"
				+ ОшибкаОднойСтрокой(Информация);
			Ошибки.Добавить(СтрокаОтчета);
			ОшибокНаОбразцах = ОшибокНаОбразцах + 1;
		КонецПопытки;
	КонецЦикла;

	// Третий проход: печатные формы. Формирование идёт на сервере, ошибки ложатся в тот же отчёт.
	Попытка
		ИтогПечати = ИтогПрогонаПечати();
	Исключение
		ИтогПечати = Новый Структура("Строки, Всего, Ошибок", Новый Массив, 0, 1);
		Информация = ИнформацияОбОшибке();
		ИтогПечати.Строки.Добавить("ОШИБКА;Печать;" + ОшибкаОднойСтрокой(Информация));
	КонецПопытки;

	Для Каждого СтрокаПечати Из ИтогПечати.Строки Цикл
		Ошибки.Добавить(СтрокаПечати);
	КонецЦикла;

	// Четвёртый проход: каждый вариант каждого отчёта со схемой компоновки формируется на сервере.
	ИтогОтчетов = ИтогПрогонаОтчетов();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Ошибки, ИтогОтчетов.Строки);

	СтрокаИтога = "ИТОГ;Всего=" + Формат(ВсегоФорм, ФорматЧисла())
		+ ";Ошибок=" + Формат(ОшибокФорм, ФорматЧисла())
		+ ";НаОбразцах=" + Формат(ВсегоНаОбразцах, ФорматЧисла())
		+ ";ОшибокНаОбразцах=" + Формат(ОшибокНаОбразцах, ФорматЧисла())
		+ ";ПечатныхФорм=" + Формат(ИтогПечати.Всего, ФорматЧисла())
		+ ";ОшибокПечати=" + Формат(ИтогПечати.Ошибок, ФорматЧисла())
		+ ";ВариантовОтчетов=" + Формат(ИтогОтчетов.Всего, ФорматЧисла())
		+ ";ОшибокОтчетов=" + Формат(ИтогОтчетов.Ошибок, ФорматЧисла());

	Если ПустаяСтрока(ПутьОтчета) Тогда
		// Интерактивный запуск - итог в окно сообщений, клиент не завершаем.
		Для Каждого СтрокаОшибки Из Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОшибки);
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаИтога);
	Иначе
		ЗаписатьОтчет(ПутьОтчета, Ошибки, СтрокаИтога);
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;

КонецПроцедуры

// Ошибка прогона одной строкой: перевод строки в отчёте разделяет записи, поэтому
// внутри описания он заменяется на разделитель. Имя не «ОписаниеОшибки»: так называется
// глобальный метод платформы без параметров, и вызов с параметром до него не доходит.
//
// Параметры:
//  Информация - ИнформацияОбОшибке - перехваченная ошибка
//
// Возвращаемое значение:
//  Строка - описание ошибки для строки отчёта
//
&НаКлиенте
Функция ОшибкаОднойСтрокой(Информация)

	// МенеджерОбработкиОшибок в клиентском контексте 8.5.1 не определён (проверено CheckConfig),
	// поэтому устаревший глобальный метод.
	// BSLLS:DeprecatedMethodCall-off
	Возврат СтрЗаменить(ПодробноеПредставлениеОшибки(Информация), Символы.ПС, " | ");
	// BSLLS:DeprecatedMethodCall-on

КонецФункции

// Режим заполнения тестовых данных: заводит недостающие образцы объектов печати и пишет
// отчёт того же формата, что и прогон. Запускается параметром /C "ТестовыеДанные;<отчёт>",
// см. scripts/fixtures.sh; параметром /C "ТестовыеДанные;<отчёт>;Демо" - демо-набор контура и торговли
// (scripts/fixtures.sh --demo), "ТестовыеДанные;<отчёт>;Демо;Станки" - ещё и блок учёта станков. Данные при этом
// ЗАПИСЫВАЮТСЯ - только тестовая база.
//
// Параметры:
//  ПутьОтчета - Строка - файл отчёта; пустая строка - интерактивный запуск
//
&НаКлиенте
Процедура ЗаполнитьТестовыеДанные(ПутьОтчета)

	ЗаписатьМаркерСтарта(ПутьОтчета, 0);

	Если РежимДемоНабора() Тогда
		Итог = ИтогДемоНабора(ДемоНаборСоСтанками());
	Иначе
		Итог = ИтогЗаполненияТестовыхДанных();
	КонецЕсли;
	СтрокаИтога = "ИТОГ;Создано=" + Формат(Итог.Создано, ФорматЧисла())
		+ ";Ошибок=" + Формат(Итог.Ошибок, ФорматЧисла())
		+ ";Было=" + Формат(Итог.Было, ФорматЧисла());

	Если ПустаяСтрока(ПутьОтчета) Тогда
		Для Каждого СтрокаОтчета Из Итог.Строки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаОтчета);
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаИтога);
	Иначе
		ЗаписатьОтчет(ПутьОтчета, Итог.Строки, СтрокаИтога);
		ЗавершитьРаботуСистемы(Ложь);
	КонецЕсли;

КонецПроцедуры

// Заполнение тестовых данных. Логика - в модуле менеджера обработки ТестовыеДанные.
//
// Возвращаемое значение:
//  Структура - см. Обработки.ТестовыеДанные.СоздатьНедостающиеОбразцы
//
&НаСервереБезКонтекста
Функция ИтогЗаполненияТестовыхДанных()

	Возврат Обработки.ТестовыеДанные.СоздатьНедостающиеОбразцы();

КонецФункции

// Демо-набор контура и торговли. Логика - в модуле менеджера обработки ТестовыеДанные. Запуск из scripts/fixtures.sh -
// явное заявление о назначении базы: она тестовая, опции набора включаются.
//
// Параметры:
//  СоСтанками - Булево - заполнить и блок учёта станков, включив учёт станков
//
// Возвращаемое значение:
//  Структура - см. Обработки.ТестовыеДанные.СоздатьДемоНабор
//
&НаСервереБезКонтекста
Функция ИтогДемоНабора(Знач СоСтанками)

	Параметры = Обработки.ТестовыеДанные.НовыеПараметрыДемоНабора();
	Параметры.ТестоваяБаза = Истина;
	Параметры.ВключитьПроизводство = Истина;
	Параметры.ВключитьАвтовыпуск = Истина;
	Если СоСтанками Тогда
		Параметры.Блоки = "CORE,M";
		Параметры.ВключитьУчетСтанков = Истина;
	КонецЕсли;
	Возврат Обработки.ТестовыеДанные.СоздатьДемоНабор(Параметры);

КонецФункции

// Четвёртая часть параметра запуска «Станки»: ТестовыеДанные;<отчёт>;Демо;Станки.
//
// Возвращаемое значение:
//  Булево - заполнить и блок учёта станков
//
&НаКлиенте
Функция ДемоНаборСоСтанками()

	ЧастейСоСтанками = 4;
	ЧастиПараметра = СтрРазделить(ПараметрЗапуска, ";");
	Возврат ЧастиПараметра.Количество() >= ЧастейСоСтанками И СокрЛП(ЧастиПараметра[3]) = "Станки";

КонецФункции

// Третья часть параметра запуска «Демо» включает режим демо-набора: ТестовыеДанные;<отчёт>;Демо.
//
// Возвращаемое значение:
//  Булево - запущено заполнение демо-набора
//
&НаКлиенте
Функция РежимДемоНабора()

	ЧастейСРежимом = 3;
	ЧастиПараметра = СтрРазделить(ПараметрЗапуска, ";");
	Возврат ЧастиПараметра.Количество() >= ЧастейСРежимом И СокрЛП(ЧастиПараметра[2]) = "Демо";

КонецФункции

// Второй проход прогона: печатные формы. Логика - в модуле менеджера обработки.
//
// Возвращаемое значение:
//  Структура - см. Обработки.СмокТест.ПрогнатьПечатныеФормы
//
&НаСервереБезКонтекста
Функция ИтогПрогонаПечати()

	Возврат Обработки.СмокТест.ПрогнатьПечатныеФормы();

КонецФункции

// Итог четвёртого прохода смока - формирование вариантов отчётов.
//
// Возвращаемое значение:
//  Структура - см. Обработки.СмокТест.ПрогнатьОтчеты
//
&НаСервереБезКонтекста
Функция ИтогПрогонаОтчетов()

	Попытка
		Возврат Обработки.СмокТест.ПрогнатьОтчеты();
	Исключение
		Итог = Новый Структура("Строки, Всего, Ошибок", Новый Массив, 0, 1);
		Представление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Итог.Строки.Добавить("ОШИБКА;Отчет;" + СтрЗаменить(Представление, Символы.ПС, " | "));
		Возврат Итог;
	КонецПопытки;

КонецФункции

&НаКлиенте
Функция ПутьФайлаОтчета()

	// Формат параметра запуска: СмокТест;<путь-к-отчёту>
	ЧастейСПутемОтчета = 2;
	ЧастиПараметра = СтрРазделить(ПараметрЗапуска, ";");
	Если ЧастиПараметра.Количество() >= ЧастейСПутемОтчета Тогда
		Возврат СокрЛП(ЧастиПараметра[1]);
	КонецЕсли;
	Возврат "";

КонецФункции

// Пишет в отчёт признак того, что клиент поднялся и прогон начался.
//
// Параметры:
//  ПутьОтчета - Строка - файл отчёта; пустая строка - интерактивный запуск, отчёт не ведётся
//  ФормКПроверке - Число - сколько форм предстоит открыть
//
&НаКлиенте
Процедура ЗаписатьМаркерСтарта(ПутьОтчета, ФормКПроверке)

	Если ПустаяСтрока(ПутьОтчета) Тогда
		Возврат;
	КонецЕсли;

	Запись = Новый ЗаписьТекста(ПутьОтчета, КодировкаТекста.UTF8);
	Запись.ЗаписатьСтроку("СТАРТ;Форм=" + Формат(ФормКПроверке, ФорматЧисла()));
	Запись.Закрыть();

КонецПроцедуры

// Имя программно добавляемого реквизита формы, в котором хранится режим работы: прогон
// или заполнение тестовых данных.
//
// Возвращаемое значение:
//  Строка - имя реквизита формы
//
&НаКлиентеНаСервереБезКонтекста
Функция ИмяРеквизитаРежима()

	Возврат "РежимТестовыхДанных";

КонецФункции

// Формат целых чисел в отчёте: без разделителей групп, чтобы строку было легко разобрать.
//
// Возвращаемое значение:
//  Строка - форматная строка
//
&НаКлиентеНаСервереБезКонтекста
Функция ФорматЧисла()

	// ЧН=0: без него нулевой счётчик печатается пустой строкой, и в итоге вместо
	// «Ошибок=0» получается «Ошибок=».
	Возврат "ЧГ=0; ЧН=0";

КонецФункции

&НаКлиенте
Процедура ЗаписатьОтчет(ПутьОтчета, Ошибки, СтрокаИтога)

	// Отчёт пишется одним файлом в конце прогона: появление строки "ИТОГ;" - признак завершения
	// для scripts/smoke.sh.
	Запись = Новый ЗаписьТекста(ПутьОтчета, КодировкаТекста.UTF8);
	Для Каждого СтрокаОшибки Из Ошибки Цикл
		Запись.ЗаписатьСтроку(СтрокаОшибки);
	КонецЦикла;
	Запись.ЗаписатьСтроку(СтрокаИтога);
	Запись.Закрыть();

КонецПроцедуры

// Формы, ветки которых работают только с параметром открытия: подбор по назначению и выбор с отбором по типу -
// навигатор номенклатуры считает узлы по этим типам (2.0.16.64).
//
// Параметры:
//  Ошибки - Массив из Строка - строки отчёта, дополняются ошибками
//
// Возвращаемое значение:
//  Число - сколько форм открыто
//
&НаКлиенте
Функция ПроверитьФормыСПараметрами(Ошибки)

	Формы = ФормыСПараметрами();
	Для Каждого Описание Из Формы Цикл
		Попытка
			// BSLLS:GetFormMethod-off
			ПолучитьФорму(Описание.Форма, Описание.Параметры);
			// BSLLS:GetFormMethod-on
		Исключение
			Информация = ИнформацияОбОшибке();
			Ошибки.Добавить("ОШИБКА;" + Описание.Форма + " (" + Описание.Пояснение + ");" + ОшибкаОднойСтрокой(Информация));
		КонецПопытки;
	КонецЦикла;
	Возврат Формы.Количество();

КонецФункции

// Возвращаемое значение:
//  Массив из Структура - Форма (полное имя), Параметры (Структура), Пояснение (Строка)
//
&НаСервереБезКонтекста
Функция ФормыСПараметрами()

	Формы = Новый Массив;
	Номенклатура = Справочники.Номенклатура;
	Назначения = Новый Массив;
	Назначения.Добавить(Номенклатура.НазначениеПодбораПродукция());
	Назначения.Добавить(Номенклатура.НазначениеПодбораМатериалы());
	Для Каждого Назначение Из Назначения Цикл
		ПараметрыФормы = Новый Структура("НазначениеПодбора", Назначение);
		Описание = Новый Структура("Форма, Параметры, Пояснение");
		Описание.Форма = "Справочник.Номенклатура.Форма.ФормаПодбора";
		Описание.Параметры = ПараметрыФормы;
		Описание.Пояснение = "назначение " + Назначение;
		Формы.Добавить(Описание);
	КонецЦикла;
	Отбор = Новый Структура("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Сырье);
	Описание = Новый Структура("Форма, Параметры, Пояснение");
	Описание.Форма = "Справочник.Номенклатура.Форма.ФормаВыбора";
	Описание.Параметры = Новый Структура("Отбор", Отбор);
	Описание.Пояснение = "отбор по типу";
	Формы.Добавить(Описание);
	Возврат Формы;

КонецФункции

#КонецОбласти
